;===========================================================================================================================================o
;                   Feng Ruohang's AHK Script                          
;                      CapsLock Enhancement                           
;                       Modify By Giligency                           
;                 感谢Feng Ruohang的脚本，感谢开源的AHK软件             
;                  AHK官网https://autohotkey.com/                           
;原脚本网址https://github.com/Vonng/Capslock/blob/master/win/CapsLock.ahk   
;--------------------------------------------------------------------------------------------------------------------------------------------o
;描述:                                                       
;    基于Feng Ruohang的脚本编写的适配Emacs方向按键设定的脚本,精简了部分内容，修改了部分内容，增加了部分内容。
;主要为两个部分：
;    一:添加Emacs风格的光标移动，基于CapsLock实现。CapsLock + pnbf 来冗余（重复）上下左右的功能，CapsLock + ae来冗余Home、End功能键，到达行首行尾
;    二:冗余Ctrl的功能。CapsLock + zxcv Space tab 等去冗余对应的Ctrl+的功能，其中CapsLock+v使用了Ditto，来实现历史粘贴的功能。
;                                                                 
;     借助与AHK可以在不破坏原有快捷键的基础上增添一个CapsLock为功能键，本脚本提供CapsLock+系列的拓展映射，让你更专注的进行编辑(光标移动)，释放你的小拇指
;(替代Ctrl)                                                            
;概览:                                                            
;------------------------------------------------o------------------------------------------------------------------------------------------o
;|CapsLock;                                      | {ESC}  发送退出命令                                                                              
;|CaspLock + u                                   | {CapsLock} 取代原本的CapsLock的功能                                                          
;|CapsLock + pnbf                                | Emacs-Style的光标移动，p是previous向上，n是next，b是back光标向后，f是forward光标向前。              
;|CapsLock + ae                                  | a是{Home},跳到行首，e是{End}，跳到行尾。                                                         
;|CapsLock + d                                   | {Delete} 删除键                                                                                       
;|CapsLock + zxcv                                | 冗余原本的Ctrl + zxcv 其中CapsLock + v实际使用的是Ditto的功能，可以调用剪贴板，查看历史粘贴       
;|CapsLock + Space                               | Ctrl + Space 切换输入法                                                                               
;|Alt + CapsLock                                 | Alt + Ctrl 标签切换之类的功能                                                                       
;------------------------------------------------o------------------------------------------------------------------------------------------o
;|Use it whatever and wherever you like. Hope it help                 |
;===========================================================================================================================================o




;=====================================================================o
;                       CapsLock Initializer                         ;|
;---------------------------------------------------------------------o
SetCapsLockState, AlwaysOff                                          ;|
;---------------------------------------------------------------------o

;=====================================================================o
;                       CapsLock Switcher:                           ;|
;---------------------------------o-----------------------------------o
;                    CapsLock + ` | {CapsLock}                       ;|
;---------------------------------o-----------------------------------o
CapsLock & u::                                                       ;|
GetKeyState, CapsLockState, CapsLock, T                              ;|
if CapsLockState = D                                                 ;|
    SetCapsLockState, AlwaysOff                                      ;|
else                                                                 ;|
    SetCapsLockState, AlwaysOn                                       ;|
KeyWait, ``                                                          ;|
return                                                               ;|
;---------------------------------------------------------------------o


;=====================================================================o
;                         CapsLock Escaper:                          ;|
;----------------------------------o----------------------------------o
;                        CapsLock  |  {ESC}                          ;|
;----------------------------------o----------------------------------o
CapsLock::Send, {ESC}                                                ;|
;---------------------------------------------------------------------o

;=====================================================================o
;                    CapsLock Direction Navigator                    ;|
;-----------------------------------o---------------------------------o
;                      CapsLock + b |  Left                          ;|
;                      CapsLock + n |  Down                          ;|
;                      CapsLock + p |  Up                            ;|
;                      CapsLock + f |  Right                         ;|
;                      Ctrl, Alt Compatible                          ;|
;-----------------------------------o---------------------------------o
CapsLock & b::                                                       ;|
if GetKeyState("control") = 0                                        ;|
{                                                                    ;|
    if GetKeyState("alt") = 0                                        ;|
        Send, {Left}                                                 ;|
    else                                                             ;|
        Send, +{Left}                                                ;|
    return                                                           ;|
}                                                                    ;|
else {                                                               ;|
    if GetKeyState("alt") = 0                                        ;|
        Send, ^{Left}                                                ;|
    else                                                             ;|
        Send, +^{Left}                                               ;|
    return                                                           ;|
}                                                                    ;|
return                                                               ;|
;-----------------------------------o                                ;|
CapsLock & n::                                                       ;|
if GetKeyState("control") = 0                                        ;|
{                                                                    ;|
    if GetKeyState("alt") = 0                                        ;|
        Send, {Down}                                                 ;|
    else                                                             ;|
        Send, +{Down}                                                ;|
    return                                                           ;|
}                                                                    ;|
else {                                                               ;|
    if GetKeyState("alt") = 0                                        ;|
        Send, ^{Down}                                                ;|
    else                                                             ;|
        Send, +^{Down}                                               ;|
    return                                                           ;|
}                                                                    ;|
return                                                               ;|
;-----------------------------------o                                ;|
CapsLock & p::                                                       ;|
if GetKeyState("control") = 0                                        ;|
{                                                                    ;|
    if GetKeyState("alt") = 0                                        ;|
        Send, {Up}                                                   ;|
    else                                                             ;|
        Send, +{Up}                                                  ;|
    return                                                           ;|
}                                                                    ;|
else {                                                               ;|
    if GetKeyState("alt") = 0                                        ;|
        Send, ^{Up}                                                  ;|
    else                                                             ;|
        Send, +^{Up}                                                 ;|
    return                                                           ;|
}                                                                    ;|
return                                                               ;|
;-----------------------------------o                                ;|
CapsLock & f::                                                       ;|
if GetKeyState("control") = 0                                        ;|
{                                                                    ;|
    if GetKeyState("alt") = 0                                        ;|
        Send, {Right}                                                ;|
    else                                                             ;|
        Send, +{Right}                                               ;|
    return                                                           ;|
}                                                                    ;|
else {                                                               ;|
    if GetKeyState("alt") = 0                                        ;|
        Send, ^{Right}                                               ;|
    else                                                             ;|
        Send, +^{Right}                                              ;|
    return                                                           ;|
}                                                                    ;|
return                                                               ;|
;---------------------------------------------------------------------o

;=====================================================================o
;                     CapsLock Home/End Navigator                    ;|
;-----------------------------------o---------------------------------o
;                      CapsLock + a |  Home                          ;|
;                      CapsLock + e |  End                           ;|
;                      Ctrl, Alt Compatible                          ;|
;-----------------------------------o---------------------------------o
CapsLock &  a::                                                      ;|
if GetKeyState("control") = 0                                        ;|
{                                                                    ;|
    if GetKeyState("alt") = 0                                        ;|
        Send, {Home}                                                 ;|
    else                                                             ;|
        Send, +{Home}                                                ;|
    return                                                           ;|
}                                                                    ;|
else {                                                               ;|
    if GetKeyState("alt") = 0                                        ;|
        Send, ^{Home}                                                ;|
    else                                                             ;|
        Send, +^{Home}                                               ;|
    return                                                           ;|
}                                                                    ;|
return                                                               ;|
;-----------------------------------o                                ;|
CapsLock & e::                                                       ;|
if GetKeyState("control") = 0                                        ;|
{                                                                    ;|
    if GetKeyState("alt") = 0                                        ;|
        Send, {End}                                                  ;|
    else                                                             ;|
        Send, +{End}                                                 ;|
    return                                                           ;|
}                                                                    ;|
else {                                                               ;|
    if GetKeyState("alt") = 0                                        ;|
        Send, ^{End}                                                 ;|
    else                                                             ;|
        Send, +^{End}                                                ;|
    return                                                           ;|
}                                                                    ;|
return                                                               ;|
;---------------------------------------------------------------------o

;=====================================================================o
;                     CapsLock Home/End Navigator                    ;|
;-----------------------------------o---------------------------------o
;                      CapsLock + d |  Delete                        ;|
;                      Ctrl, Alt Compatible                          ;|
;-----------------------------------o---------------------------------o
CapsLock & d::                                                       ;|
if GetKeyState("control") = 0                                        ;|
{                                                                    ;|
    if GetKeyState("alt") = 0                                        ;|
        Send, {Delete}                                               ;|
    else                                                             ;|
        Send, +{Delete}                                              ;|
    return                                                           ;|
}                                                                    ;|
else {                                                               ;|
    if GetKeyState("alt") = 0                                        ;|
        Send, ^{Delete}                                              ;|
    else                                                             ;|
        Send, +^{Delete}                                             ;|
    return                                                           ;|
}                                                                    ;|
return                                                               ;|
;---------------------------------------------------------------------o

;=====================================================================o
;                      CapsLock c  Navigator                         ;|
;-----------------------------------o---------------------------------o
;                      CapsLock + c |  copy (native)                 ;|
;                            Alt Compatible                          ;|
;-----------------------------------o---------------------------------o
CapsLock & c::                                                       ;|
if GetKeyState("alt") = 0                                            ;|
    Send, ^c                                                         ;|
else                                                                 ;|
    Send, !^c                                                        ;|
return                                                               ;|
                                                                     ;|
;---------------------------------------------------------------------o

;=====================================================================o
;                      CapsLock v  Navigator                         ;|
;-----------------------------------o---------------------------------o
;                      CapsLock + v |  Ditto paste                   ;|
;                           使用Ditto进行粘贴                         ;|
;                           使用Ditto的快捷键                         ;|   
;                            Alt Compatible                          ;|
;-----------------------------------o---------------------------------o
CapsLock & v::                                                       ;|
if GetKeyState("alt") = 0                                            ;|
    Send, ^#/                                                        ;|
else                                                                 ;|
return                                                               ;|
                                                                     ;|
;---------------------------------------------------------------------o

;=====================================================================o
;                      CapsLock z  Navigator                         ;|
;-----------------------------------o---------------------------------o
;                      CapsLock + z |  undo (native)                 ;|  
;                            Alt Compatible                          ;|
;-----------------------------------o---------------------------------o
CapsLock & z::                                                       ;|
if GetKeyState("alt") = 0                                            ;|
    Send, ^z                                                         ;|
else                                                                 ;|
    Send, !^z                                                        ;|
return                                                               ;|
                                                                     ;|
;---------------------------------------------------------------------o

;=====================================================================o
;                      CapsLock s  Navigator                         ;|
;-----------------------------------o---------------------------------o
;                      CapsLock + s |  save (native)                 ;|  
;                            Alt Compatible                          ;|
;-----------------------------------o---------------------------------o
CapsLock & s::                                                       ;|
if GetKeyState("alt") = 0                                            ;|
    Send, ^s                                                         ;|
else                                                                 ;|
    Send, !^s                                                        ;|
return                                                               ;|
                                                                     ;|
;---------------------------------------------------------------------o


;=====================================================================o
;                      CapsLock Space  Navigator                     ;|
;-----------------------------------o---------------------------------o
;                      CapsLock + Space |  切换输入法                 ;|  
;-----------------------------------o---------------------------------o
CapsLock & Space::Send, ^{Space}                                   ;|                       
;---------------------------------------------------------------------o



;=============================================================================o
;                      CapsLock Alt  Navigator                               ;|   
;-----------------------------------o-----------------------------------------o
;                    CapsLock + Alt | 替换掉Ctrl+Tab 一般用于交换应用内部的标签 ;|                    
;-----------------------------------o-----------------------------------------o
Alt & CapsLock::Send, ^{Tab}                                                 ;|
;-----------------------------------------------------------------------------o

;=====================================================================o
;                      CapsLock + Intellj   Navigator                ;|
;-----------------------------------o---------------------------------o
;           一些CapsLock复用Ctrl的映射，主要是为了服务Intellij          ;|
;-----------------------------------o---------------------------------o
CapsLock & w::Send, ^w              ;Intellij的Extend Selection
CapsLock & m::Send, ^m              ;Intellij的光标居中
;---------------------------------------------------------------------o


;=============================================================================o
;                      Other         Navigator                               ;|   
;-----------------------------------o-----------------------------------------o
;                    在任务栏上滚动滚轮：增加/减小音量。|                       ;|
;-----------------------------------o-----------------------------------------o
;#If MouseIsOver("ahk_class Shell_TrayWnd")                                    ;|
;WheelUp::Send {Volume_Up}     ;                                               ;|
;WheelDown::Send {Volume_Down} ;                                               ;|
;-----------------------------------------------------------------------------o

